# Data Transformation in Pandas

In [1]:
import pandas as pd

C:\Users\Dipen\Anaconda3\lib\site-packages\pandas\compat\_optional.py:138: UserWarning: Pandas requires version '2.7.0' or newer of 'numexpr' (version '2.6.9' currently installed).
  warnings.warn(msg, UserWarning)

In [2]:
data=pd.DataFrame({"a":["one","two"]*3,
                   "b":[1,1,2,3,2,3]})
data

     a  b
0  one  1
1  two  1
2  one  2
3  two  3
4  one  2
5  two  3

In [3]:
# Returns true if duplicate value is encountered, else false
data.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [4]:
data.drop_duplicates() # deleting duplicate values

     a  b
0  one  1
1  two  1
2  one  2
3  two  3

In [5]:
data["c"]=range(6)  # Create a new column named 'c' and assign the values from 0 to 5
data

     a  b  c
0  one  1  0
1  two  1  1
2  one  2  2
3  two  3  3
4  one  2  4
5  two  3  5

In [6]:
# Check for duplicate values on columns 'a' and 'b' and keep the last copy
data.duplicated(["a","b"],keep="last")

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [7]:
df=pd.DataFrame({"names":["Tim","tom","Sam",
                          "kate","Kim"],
                "scores":[60,50,70,80,40]})
df

  names  scores
0   Tim      60
1   tom      50
2   Sam      70
3  kate      80
4   Kim      40

In [9]:
# Dictionary consiting of key value pairs
classes={"Tim":"A","Tom":"A","Sam":"B",
         "Kate":"B","Kim":"B"}

In [10]:
n=df["names"].str.capitalize()  # Storing values from 'names' column and cap
print(n)

0     Tim
1     Tom
2     Sam
3    Kate
4     Kim
Name: names, dtype: object

In [11]:
df["branches"]=n.map(classes)

In [12]:
df

  names  scores branches
0   Tim      60        A
1   tom      50        A
2   Sam      70        B
3  kate      80        B
4   Kim      40        B

In [ ]:
s=pd.Series([80,70,90,60])
s

In [ ]:
import numpy as np

In [ ]:
s.replace(70,np.nan)

In [ ]:
s.replace([70,60],[np.nan,0])

In [ ]:
s.replace({90:100,60:0})

In [ ]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=[0,1,2],
    columns=["tim","tom","kim","sam"])
df

In [ ]:
s=pd.Series(["one","two","three"])
df.index=df.index.map(s)

In [ ]:
df

In [ ]:
df.rename(index=str.title,columns=str.upper)

In [ ]:
df.rename(index={"one":"ten"},
          columns={"sam":"kate"},
          inplace=True)
df

## Dummy Variable

In [ ]:
data=pd.DataFrame(
    {"letter":["c","b","a","b","b","a"],
                   "number":range(6)})
data

In [ ]:
# One hot encoding of the column 'letter'
pd.get_dummies(data["letter"])

In [ ]:
data=np.random.randn(10)
data

In [ ]:
pd.get_dummies(pd.cut(data,4))